# RailingDoublyConnectedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RailingDoublyConnectedError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Railings hosted on Stairs must form a single, open, connected line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailingDoublyConnectedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingDoublyConnectedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailingDoublyConnectedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace